In [ ]:
# Write data in CSV file

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("pd_employee_data.csv")

In [5]:
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [11]:
df2 = df.copy()

# Remove dupplicates
df2 = df2.drop_duplicates()

In [15]:
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   0.0  Canada   Female  62000.0
3    3          Alex   0.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      0.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6             0  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0       0     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   0.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA        0  58000.0

In [13]:
# Write 0 in plance of empty value
df2 = df2.fillna(0)

In [14]:
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   0.0  Canada   Female  62000.0
3    3          Alex   0.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      0.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6             0  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0       0     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   0.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA        0  58000.0

In [16]:
# Sort the value on the basis of income
df2 = df2.sort_values("income")

In [17]:
df2

    id          name   age country   gender   income
4    4  Maria Garcia  34.0   Spain   Female      0.0
9    9   Carlos Ruiz   0.0  Mexico     Male  45000.0
3    3          Alex   0.0     USA  Unknown  47000.0
5    5        Li Wei  27.0   China     Male  51000.0
0    1      John Doe  29.0     USA     Male  55000.0
10  10   Emily Davis  31.0     USA        0  58000.0
2    2    Jane Smith   0.0  Canada   Female  62000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
7    7    Ahmed Khan  38.0       0     Male  68000.0
6    6             0  45.0   India   Female  73000.0

In [20]:
# Now we want to store this data in csv
df2.to_csv("Sorted_data.csv")

# A CSV file will be created in same location as name Sorted_data.csv with our above sorted data